export const CONSTANTS = {
  get SPREADSHEET_ID(): string {
    return process.env.GOOGLE_SHEET_ID || '';
  },
  TAX_RATE: 0.06,
  CASH_ON_DELIVERY_FEE: 0.05,

  PRINTERS: {
    'Flashforge Adventurer 5m': 10,
    'Flashforge Adventurer 5m Pro': 14,
    'Qidi Q2': 25
  },

  MATERIALS: {
    'PETG Гексалит': 1.5,
    'ASA Elegoo': 3,
    'ABS': 2,
    'PA12': 10,
    'PA6': 8,
    'PA-CF': 8
  },

  READY_PRODUCTS: {
    'Фигурка дракона': 400,
    'Фигурка совы': 350,
    'Фигурка рыцаря': 500,
    'Фигурка космонавта': 450,
    'Ваза геометрическая': 300,
    'Светильник луна': 600
  },

  SHEET_COLUMNS: [
    'Дата', 'Изделие', 'Кол-во', 'Материал', 'Место продажи', 'Доставка',
    'Сумма продажи', 'Сумма доставки', 'Форма платежа', 'Принтер',
    'Затраты на пр-во', 'Прибыль', 'Год', 'Месяц', 'Ком. места прод.',
    'Ком. платежа', 'Налог', 'Способ контакта',
    'Дата отправки по договоренности', 'Статус', 'Комментарий'
  ]
};